package com.example.stu;

import androidx.appcompat.app.AppCompatActivity;
import android.content.Intent;
import android.os.Bundle;
import android.widget.Button;
import android.widget.ImageButton;
import android.widget.TextView;
import java.util.Calendar;
import java.util.Random;

public class QuranActivity extends AppCompatActivity {

    ImageButton btnOpenQuran;
    TextView tvDailyVerse;
    TextView tvVerseLabel;

    String[] dailyVerses = {
            "1|1|শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।",
            "1|2|যাবতীয় প্রশংসা আল্লাহ তাআলার যিনি সকল সৃষ্টি জগতের পালনকর্তা।",
            "1|3|যিনি নিতান্ত মেহেরবান ও দয়ালু।",
            "1|4|যিনি বিচার দিনের মালিক।",
            "1|5|আমরা একমাত্র তোমারই ইবাদত করি এবং শুধুমাত্র তোমারই সাহায্য প্রার্থনা করি।",
            "1|6|আমাদেরকে সরল পথ দেখাও,",
            "1|7|সে সমস্ত লোকের পথ, যাদেরকে তুমি নেয়ামত দান করেছ। তাদের পথ নয়, যাদের প্রতি তোমার গজব নাযিল হয়েছে এবং যারা পথভ্রষ্ট হয়েছে।",
            "2|255|আল্লাহ ছাড়া অন্য কোন উপাস্য নেই, তিনি জীবিত, সবকিছুর ধারক। তাঁকে তন্দ্রাও স্পর্শ করতে পারে না এবং নিদ্রাও নয়। আসমান ও যমীনে যা কিছু রয়েছে, সবই তাঁর। কে আছ এমন, যে সুপারিশ করবে তাঁর কাছে তাঁর অনুমতি ছাড়া? দৃষ্টির সামনে কিংবা পিছনে যা কিছু রয়েছে সে সবই তিনি জানেন। তাঁর জ্ঞানসীমা থেকে তারা কোন কিছুকেই পরিবেষ্টিত করতে পারে না, কিন্তু যতটুকু তিনি ইচ্ছা করেন। তাঁর সিংহাসন সমস্ত আসমান ও যমীনকে পরিবেষ্টিত করে আছে। আর সেগুলোকে ধারণ করা তাঁর পক্ষে কঠিন নয়। তিনিই সর্বোচ্চ এবং সর্বাপেক্ষা মহান।",
            "2|285|রসূল বিশ্বাস রাখেন ঐ সমস্ত বিষয় সম্পর্কে যা তাঁর পালনকর্তার পক্ষ থেকে তাঁর কাছে অবতীর্ণ হয়েছে এবং মুসলমানরাও সবাই বিশ্বাস রাখে আল্লাহর প্রতি, তাঁর ফেরেশতাদের প্রতি, তাঁর গ্রন্থসমুহের প্রতি এবং তাঁর পয়গম্বরগণের প্রতি। তারা বলে আমরা তাঁর পয়গম্বরদের মধ্যে কোন তারতম্য করিনা। তারা বলে, আমরা শুনেছি এবং কবুল করেছি। আমরা তোমার ক্ষমা চাই, হে আমাদের পালনকর্তা। তোমারই দিকে প্রত্যাবর্তন করতে হবে।",
            "2|286|আল্লাহ কাউকে তার সাধ্যাতীত কোন কাজের ভার দেন না, সে তাই পায় যা সে উপার্জন করে এবং তাই তার উপর বর্তায় যা সে করে। হে আমাদের পালনকর্তা, যদি আমরা ভুলে যাই কিংবা ভুল করি, তবে আমাদেরকে অপরাধী করো না। হে আমাদের পালনকর্তা! এবং আমাদের উপর এমন দায়িত্ব অর্পণ করো না, যেমন আমাদের পূর্ববর্তীদের উপর অর্পণ করেছ, হে আমাদের প্রভূ! এবং আমাদের দ্বারা ঐ বোঝা বহন করিও না, যা বহন করার শক্তি আমাদের নাই। আমাদের পাপ মোচন কর। আমাদেরকে ক্ষমা কর এবং আমাদের প্রতি দয়া কর। তুমিই আমাদের প্রভু। সুতরাং কাফের সম্প্রদায়ের বিরুদ্ধে আমাদের কে সাহায্যে কর।",
            "3|16|যারা বলে, হে আমাদের পালনকর্তা, আমরা ঈমান এনেছি, কাজেই আমাদের গোনাহ ক্ষমা করে দাও আর আমাদেরকে দোযখের আযাব থেকে রক্ষা কর।",
            "3|17|তারা ধৈর্য্যধারণকারী, সত্যবাদী, নির্দেশ সম্পাদনকারী, সৎপথে ব্যয়কারী এবং শেষরাতে ক্ষমা প্রার্থনাকারী।",
            "3|53|হে আমাদের পালনকর্তা! আমরা সে বিষয়ের প্রতি বিশ্বাস স্থাপন করেছি যা তুমি নাযিল করেছ, আমরা রসূলের অনুগত হয়েছি। অতএব, আমাদিগকে মান্যকারীদের তালিকাভুক্ত করে নাও।",
            "3|54|এবং কাফেরেরা চক্রান্ত করেছে আর আল্লাহও কৌশল অবলম্বন করেছেন। বস্তুতঃ আল্লাহ হচ্ছেন সর্বোত্তম কুশলী।",
            "3|55|আর স্মরণ কর, যখন আল্লাহ বলবেন, হে ঈসা! আমি তোমাকে নিয়ে নেবো এবং তোমাকে নিজের দিকে তুলে নিবো-কাফেরদের থেকে তোমাকে পবিত্র করে দেবো। আর যারা তোমার অনুগত রয়েছে তাদেরকে কিয়ামতের দিন পর্যন্ত যারা অস্বীকৃতি জ্ঞাপন করে তাদের উপর জয়ী করে রাখবো। বস্তুতঃ তোমাদের সবাইকে আমার কাছেই ফিরে আসতে হবে। তখন যে বিষয়ে তোমরা বিবাদ করতে, আমি তোমাদের মধ্যে তার ফয়সালা করে দেবো।",
            "3|118|হে ঈমানদারগণ! তোমরা মুমিন ব্যতীত অন্য কাউকে অন্তরঙ্গরূপে গ্রহণ করো না, তারা তোমাদের অমঙ্গল সাধনে কোন ক্রটি করে না-তোমরা কষ্টে থাক, তাতেই তাদের আনন্দ। শত্রুতাপ্রসুত বিদ্বেষ তাদের মুখেই ফুটে বেরোয়। আর যা কিছু তাদের মনে লুকিয়ে রয়েছে, তা আরো অনেকগুণ বেশী জঘন্য। তোমাদের জন্যে নিদর্শন বিশদভাবে বর্ণনা করে দেয়া হলো, যদি তোমরা তা অনুধাবন করতে সমর্থ হও।",
            "7|27|হে বনী-আদম শয়তান যেন তোমাদেরকে বিভ্রান্ত না করে; যেমন সে তোমাদের পিতামাতাকে জান্নাত থেকে বের করে দিয়েছে এমতাবস্থায় যে, তাদের পোশাক তাদের থেকে খুলিয়ে দিয়েছি-যাতে তাদেরকে লজ্জাস্থান দেখিয়ে দেয়। সে এবং তার দলবল তোমাদেরকে দেখে, যেখান থেকে তোমরা তাদেরকে দেখ না। আমি শয়তানদেরকে তাদের বন্ধু করে দিয়েছি, যারা বিশ্বাস স্থাপন করে না।",
            "7|87|আর যদি তোমাদের একদল ঐ বিষয়ের প্রতি বিশ্বাস স্থাপন করে যা নিয়ে আমি প্রেরিত হয়েছে এবং একদল বিশ্বাস স্থাপন করে যা নিয়ে আমি প্রেরিত হয়েছি এবং একদল বিশ্বাস স্থাপন না করে, তবে ছবর কর যে পর্যন্ত আল্লাহ আমাদের মধ্যে মীমাংসা না করে দেন। তিনিই শ্রেষ্ট মীমাংসাকারী।",
            "7|88|তার সম্প্রদায়ের দাম্ভিক সর্দাররা বললঃ হে শোয়ায়েব, আমরা অবশ্যই তোমাকে এবং তোমার সাথে বিশ্বাস স্থাপনকারীদেরকে শহর থেকে বের করে দেব অথবা তোমরা আমাদের ধর্মে প্রত্যাবর্তন করবে। শোয়ায়েব বললঃ আমরা অপছন্দ করলেও কি ?",
            "7|89|আমরা আল্লাহর প্রতি মিথ্যা অপবাদকারী হয়ে যাব যদি আমরা তোমাদের ধর্মে প্রত্যাবর্তন করি, অথচ তিনি আমাদেরকে এ থেকে মুক্তি দিয়েছেন। আমাদের কাজ নয় এ ধর্মে প্রত্যাবর্তন করা, কিন্তু আমাদের প্রতি পালনক আল্লাহ যদি চান। আমাদের প্রতিপালক প্রত্যেক বস্তুকে স্বীয় জ্ঞান দ্বারা বেষ্টন করে আছেন। আল্লাহর প্রতিই আমরা ভরসা করেছি। হে আমাদের প্রতিপালক আমাদের ও আমাদের সম্প্রদায়ের মধ্যে ফয়সালা করে ছিল যথার্থ ফয়সালা। আপনিই শ্রেষ্টতম ফসলা ফয়সালাকারী।",
            "7|90|তার সম্প্রদায়ের কাফের সর্দাররা বললঃ যদি তোমরা শোয়ায়েবের অনুসরণ কর, তবে নিশ্চিতই ক্ষতিগ্রস্ত হবে।",
            "7|91|অনন্তর পাকড়াও করল তাদেরকে ভূমিকম্প। ফলে তারা সকাল বেলায় গৃহ মধ্যে উপুড় হয়ে পড়ে রইল।",
            "9|38|হে ঈমানদারগণ, তোমাদের কি হল, যখন আল্লাহর পথে বের হবার জন্যে তোমাদের বলা হয়, তখন মাটি জড়িয়ে ধর, তোমরা কি আখেরাতের পরিবর্তে দুনিয়ার জীবনে পরিতুষ্ট হয়ে গেলে? অথচ আখেরাতের তুলনায় দুনিয়ার জীবনের উপকরণ অতি অল্প।",
            "11|4|আল্লাহর সান্নিধ্যেই তোমাদেরকে ফিরে যেতে হবে। আর তিনি সব কিছুর উপর ক্ষমতাবান।",
            "11|34|আর আমি তোমাদের নসীহত করতে চাইলেও তা তোমাদের জন্য ফলপ্রসূ হবে না, যদি আল্লাহ তোমাদেরকে গোমরাহ করতে চান; তিনিই তোমাদের পালনকর্তা এবং তাঁর কাছেই তোমাদের ফিরে যেতে হবে।",
            "11|35|তারা কি বলে? আপনি কোরআন রচনা করে এনেছেন? আপনি বলে দিন আমি যদি রচনা করে এনে থাকি, তবে সে অপরাধ আমার, আর তোমরা যেসব অপরাধ কর তার সাথে আমার কোন সম্পর্ক নেই।",
            "11|36|আর নূহ (আঃ) এর প্রতি ওহী প্রেরণ করা হলো যে, যারা ইতিমধ্যেই ঈমান এনেছে তাদের ছাড়া আপনার জাতির অন্য কেউ ঈমান আনবেনা এতএব তাদের কার্যকলাপে বিমর্ষ হবেন না।",
            "11|37|আর আপনি আমার সম্মুখে আমারই নির্দেশ মোতাবেক একটি নৌকা তৈরী করুন এবং পাপিষ্ঠদের ব্যাপারে আমাকে কোন কথা বলবেন না। অবশ্যই তারা ডুবে মরবে।",
            "11|38|তিনি নৌকা তৈরী করতে লাগলেন, আর তাঁর কওমের নেতৃস্থানীয় ব্যক্তিরা যখন পার্শ্ব দিয়ে যেত, তখন তাঁকে বিদ্রুপ করত। তিনি বললেন, তোমরা যদি আমাদের উপহাস করে থাক, তবে তোমরা যেমন উপহাস করছ আমরাও تদ্রূপ তোমাদের উপহাস করছি।",
            "11|39|অতঃপর অচিরেই জানতে পারবে-লাঞ্ছনাজনক আযাব কার উপর আসে এবং চিরস্থায়ী আযাব কার উপর অবতরণ করে।",
            "15|51|আপনি তাদেরকে ইব্রাহীমের মেহমানদের অবস্থা শুনিয়ে দিন।",
            "15|52|যখন তারা তাঁর গৃহে আগমন করল এবং বললঃ সালাম। তিনি বললেনঃ আমরা তোমাদের ব্যাপারে ভীত।",
            "15|53|তারা বলল： ভয় করবেন না। আমরা আপনাকে একজন জ্ঞানবান ছেলে-সন্তানের সুসংবাদ দিচ্ছি।",
            "15|54|তিনি বললেনঃ তোমরা কি আমাকে এমতাবস্থায় সুসংবাদ দিচ্ছ, যখন আমি বার্ধক্যে পৌছে গেছি ?",
            "17|107|বলুন： তোমরা কোরআনকে মান্য কর অথবা অমান্য কর; যারা এর পূর্ব থেকে এলেম প্রাপ্ত হয়েছে, যখন তাদের কাছে এর তেলাওয়াত করা হয়, তখন তারা নতমস্তকে সেজদায় লুটিয়ে পড়ে।",
            "17|108|এবং বলেঃ আমাদের পালনকর্তা পবিত্র, মহান। নিঃসন্দেহে আমাদের পালকর্তার ওয়াদা অবশ্যই পূর্ণ হবে।",
            "17|109|তারা ক্রন্দন করতে করতে নতমস্তকে ভুমিতে লুটিয়ে পড়ে এবং তাদের বিনয়ভাব আরো বৃদ্ধি পায়।",
            "17|110|বলুনঃ আল্লাহ বলে আহবান কর কিংবা রহমান বলে, যে নামেই আহবান কর না কেন, সব সুন্দর নাম তাঁরই। আপনি নিজের নামায আদায়কালে স্বর উচ্চগ্রাসে নিয়ে গিয়ে পড়বেন না এবং নিঃশব্দেও পড়বেন না। এতদুভয়ের মধ্যমপন্থা অবলম্বন করুন",
            "18|1|সব প্রশংসা আল্লাহর যিনি নিজের বান্দার প্রতি এ গ্রন্থ নাযিল করেছেন এবং তাতে কোন বক্রতা রাখেননি।",
            "18|2|একে সুপ্রতিষ্ঠিত করেছেন যা আল্লাহর পক্ষ থেকে একটি ভীষণ বিপদের ভয় প্রদর্শন করে এবং মুমিনদেরকে যারা সৎকর্ম সম্পাদন করে-তাদেরকে সুসংবাদ দান করে যে, তাদের জন্যে উত্তম প্রতিদান রয়েছে।",
            "18|3|তারা তাতে চিরকাল অবস্থান করবে।",
            "18|4|এবং তাদেরকে ভয় প্রদর্শন করার জন্যে যারা বলে যে, আল্লাহর সন্তান রয়েছে।",
            "18|5|এ সম্পর্কে তাদের কোন জ্ঞান নেই এবং তাদের পিতৃপুরুষদেরও নেই। কত কঠিন তাদের মুখের কথা। তারা যা বলে তা তো সবই মিথ্যা।",
            "18|6|যদি তারা এই বিষয়বস্তুর প্রতি বিশ্বাস স্থাপন না করে, তবে তাদের পশ্চাতে সম্ভবতঃ আপনি পরিতাপ করতে করতে নিজের প্রাণ নিপাত করবেন।",
            "18|7|আমি পৃথিবীস্থ সব কিছুকে পৃথিবীর জন্যে শোভা করেছি, যাতে লোকদের পরীক্ষা করি যে, তাদের মধ্যে কে ভাল কাজ করে।",
            "18|8|এবং তার উপর যা কিছু রয়েছে, অবশ্যই তা আমি উদ্ভিদশূন্য মাটিতে পরিণত করে দেব।",
            "18|9|আপনি কি ধারণা করেন যে, গুহা ও গর্তের অধিবাসীরা আমার নিদর্শনাবলীর মধ্যে বিস্ময়কর ছিল ?",
            "18|10|যখন যুবকরা পাহাড়ের গুহায় আশ্রয়গ্রহণ করে তখন দোআ করেঃ হে আমাদের পালনকর্তা, আমাদেরকে নিজের কাছ থেকে রহমত দান করুন এবং আমাদের জন্যে আমাদের কাজ সঠিকভাবে পূর্ণ করুন।",
            "18|100|সেদিন আমি কাফেরদের কাছে জাহান্নামকে প্রত্যক্ষ ভাবে উপস্থিত করব।",
            "18|101|যাদের চক্ষুসমূহের উপর পর্দা ছিল আমার স্মরণ থেকে এবং যারা শুনতেও সক্ষম ছিল না।",
            "18|102|কাফেররা কি মনে করে যে, তারা আমার পরিবর্তে আমার বান্দাদেরকে অভিভাবক রূপে গ্রহণ করবে? আমি কাফেরদের অভ্যর্থনার জন্যে জাহান্নামকে প্রস্তুত করে রেখেছি।",
            "18|103|বলুনঃ আমি কি তোমাদেরকে সেসব লোকের সংবাদ দেব, যারা কর্মের দিক দিয়ে খুবই ক্ষতিগ্রস্ত।",
            "18|104|তারাই সে লোক, যাদের প্রচেষ্টা পার্থিবজীবনে বিভ্রান্ত হয়, অথচ তারা মনে করে যে, তারা সৎকর্ম করেছে।",
            "18|105|তারাই সে লোক, যারা তাদের পালনকর্তার নিদর্শনাবলী এবং তাঁর সাথে সাক্ষাতের বিষয় অস্বীকার করে। ফলে তাদের কর্ম নিষ্ফল হয়ে যায়। সুতরাং কেয়ামতের দিন তাদের জন্য আমি কোন গুরুত্ব স্থির করব না।",
            "18|106|জাহান্নাম-এটাই তাদের প্রতিফল; কারণ, তারা কাফের হয়েছে এবং আমার নিদর্শনাবলী ও রসূলগণকে বিদ্রূপের বিষয় রূপে গ্রহণ করেছে।",
            "18|107|যারা বিশ্বাস স্থাপন করে ও সৎকর্ম সম্পাদন করে, তাদের অভ্যর্থনার জন্যে আছে জান্নাতুল ফেরদাউস।",
            "18|108|সেখানে তারা চিরকাল থাকবে, সেখান থেকে স্থান পরিবর্তন করতে চাইবে না।",
            "18|109|বলুনঃ আমার পালনকর্তার কথা, লেখার জন্যে যদি সমুদ্রের পানি কালি হয়, তবে আমার পালনকর্তার কথা, শেষ হওয়ার আগেই সে সমুদ্র নিঃশেষিত হয়ে যাবে। সাহায্যার্থে অনুরূপ আরেকটি সমুদ্র এনে দিলেও।",
            "18|110|বলুনঃ আমি ও তোমাদের মতই একজন মানুষ, আমার প্রতি আদেশ হয় যে, তোমাদের ইলাহই একমাত্র ইলাহ। অতএব, যে ব্যক্তি তার পালনকর্তার সাক্ষাত কামনা করে, সে যেন, সৎকর্ম সম্পাদন করে এবং তার পালনকর্তার এবাদতে কাউকে শরীক না করে।",
            "55|1|করুনাময় আল্লাহ।",
            "55|2|শিক্ষা দিয়েছেন কোরআন,",
            "55|3|সৃষ্টি করেছেন মানুষ,",
            "55|4|তাকে শিখিয়েছেন বর্ণনা।",
            "55|5|সূর্য ও চন্দ্র হিসাবমত চলে।",
            "55|6|এবং তৃণলতা ও বৃক্ষাদি সেজদারত আছে।",
            "55|7|তিনি আকাশকে করেছেন সমুন্নত এবং স্থাপন করেছেন তুলাদন্ড।",
            "55|8|যাতে তোমরা সীমালংঘন না কর তুলাদন্ডে।",
            "55|9|তোমরা ন্যায্য ওজন কায়েম কর এবং ওজনে কম দিয়ো না।",
            "55|10|তিনি পৃথিবীকে স্থাপন করেছেন সৃষ্টিজীবের জন্যে।",
            "55|11|এতে আছে ফলমূল এবং বহিরাবরণবিশিষ্ট খর্জুর বৃক্ষ।",
            "55|12|আর আছে খোসাবিশিষ্ট শস্য ও সুগন্ধি ফুল।",
            "55|13|অতএব, তোমরা উভয়ে তোমাদের পালনকর্তার কোন কোন অনুগ্রহকে অস্বীকার করবে?",
            "55|14|তিনি মানুষকে সৃষ্টি করেছেন পোড়া মাটির ন্যায় শুষ্ক মৃত্তিকা থেকে।",
            "55|15|এবং জিনকে সৃষ্টি করেছেন অগ্নিশিখা থেকে।",
            "55|16|অতএব, তোমরা উভয়ে তোমাদের পালনকর্তার কোন কোন অনুগ্রহ অস্বীকার করবে?",
            "55|17|তিনি দুই উদয়াচল ও দুই অস্তাচলের মালিক।",
            "55|18|অতএব, তোমরা উভয়ে তোমাদের পালনকর্তার কোন কোন অবদানকে অস্বীকার করবে?",
            "55|19|তিনি পাশাপাশি দুই দরিয়া প্রবাহিত করেছেন।",
            "55|20|উভয়ের মাঝখানে রয়েছে এক huntরাল, যা তারা অতিক্রম করে না।",
            "55|21|অতএব, তোমরা উভয়ে তোমাদের পালনকর্তার কোন কোন অবদানকে অস্বীকার করবে?",
            "55|22|উভয় দরিয়া থেকে উৎপন্ন হয় মোতি ও প্রবাল।",
            "7|28|মুমিনগণ, তোমরা আল্লাহকে ভয় কর এবং তাঁর রসূলের প্রতি বিশ্বাস স্থাপন কর। তিনি নিজে অনুগ্রহের দ্বিগুণ অংশ তোমাদেরকে দিবেন, তোমাদেরকে দিবেন জ্যোতি, যার সাহায্যে তোমরা চলবে এবং তোমাদেরকে ক্ষমা করবেন। আল্লাহ ক্ষমাশীল, দয়াময়।",
            "57|29|যাতে কিতাবধারীরা জানে যে, আল্লাহর সামান্য অনুগ্রহের উপর ও তাদের কোন ক্ষমতা নেই, দয়া আল্লাহরই হাতে; তিনি যাকে ইচ্ছা, তা দান করেন। আল্লাহ মহা অনুগ্রহশীল।",
            "97|1|আমি একে নাযিল করেছি শবে-কদরে।",
            "97|2|শবে-কদর সমন্ধে আপনি কি জানেন?",
            "97|3|শবে-কদর হল এক হাজার মাস অপেক্ষা শ্রেষ্ঠ।",
            "97|4|এতে প্রত্যেক কাজের জন্যে ফেরেশতাগণ ও রূহ অবতীর্ণ হয় তাদের পালনকর্তার নির্দেশক্রমে।",
            "97|5|এটা নিরাপত্তা, যা ফজরের উদয় পর্যন্ত অব্যাহত থাকে।",
            "108|1|নিশ্চয় আমি আপনাকে কাওসার দান করেছি।",
            "108|2|অতএব আপনার পালনকর্তার উদ্দেশ্যে নামায পড়ুন এবং কোরবানী করুন।",
            "108|3|যে আপনার শত্রু, সেই তো লেজকাটা, নির্বংশ।",
            "112|1|বলুন, তিনি আল্লাহ, এক,",
            "112|2|আল্লাহ অমুখাপেক্ষী,",
            "112|3|তিনি কাউকে জন্ম দেননি এবং কেউ তাকে জন্ম দেয়নি",
            "112|4|এবং তার সমতুল্য কেউ নেই।",
            "113|1|বলুন, আমি আশ্রয় গ্রহণ করছি প্রভাতের পালনকর্তার,",
            "113|2|তিনি যা সৃষ্টি করেছেন, তার অনিষ্ট থেকে,",
            "113|3|অন্ধকার রাত্রির অনিষ্ট থেকে, যখন তা সমাগত হয়,",
            "113|4|গ্রন্থিতে ফুঁৎকার দিয়ে জাদুকারিনীদের অনিষ্ট থেকে",
            "113|5|এবং হিংসুকের অনিষ্ট থেকে যখন সে হিংসা করে।",
            "114|1|বলুন, আমি আশ্রয় গ্রহণ করিতেছি মানুষের পালনকর্তার,",
            "114|2|মানুষের অধিপতির,",
            "114|3|মানুষের মা’বুদের",
            "114|4|তার অনিষ্ট থেকে, যে কুমন্ত্রণা দেয় ও আত্নগোপন করে,",
            "114|5|যে কুমন্ত্রণা দেয় মানুষের অন্তরে",
            "114|6|জ্বিনের মধ্য থেকে অথবা মানুষের মধ্য থেকে।"
    };

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_quran);

        btnOpenQuran = findViewById(R.id.btnOpenQuran);
        tvDailyVerse = findViewById(R.id.tvDailyVerse);
        tvVerseLabel = findViewById(R.id.tvVerseLabel);

        // ------------------------------
        // Daily random verse (changes at 12 AM)
        // ------------------------------
        Calendar calendar = Calendar.getInstance();
        int dayOfYear = calendar.get(Calendar.DAY_OF_YEAR);

        Random random = new Random(dayOfYear); // seed with day of year
        int index = random.nextInt(dailyVerses.length);
        String currentVerse = dailyVerses[index];

        tvDailyVerse.setText(currentVerse);
        // ------------------------------

        btnOpenQuran.setOnClickListener(v -> {
            Intent intent = new Intent(QuranActivity.this,QuranBook.class);
            startActivity(intent);
        });
    }
}
